[
  {
    "id": "doc1_0",
    "document": "KONGU ENGINEERING COLLEGE, PERUNDURAI, ERODE-638 060\n(Autonomous)\n\nRef: KEC/PRL/CIR-188/2025-26\nNovember 29, 2025\n\nCIRCULAR\n\nLEAVE NORMS\n\nRevised Leave norms for Faculty and Staff of Kongu Engineering College with effect from 01.12.2025 are as follows:",
    "metadata": {
      "doc_id": "DOC4",
      "doc_title": "Leave Norms Circular",
      "doc_date": "2025-11-29",
      "doc_type": "Circular",
      "category": "Leave Policy",
      "chunk_index": 0
    }
  },

  {
    "id": "doc1_1",
    "document": "1) Casual Leave:\n*   12 days for the academic year, limited to 1 day / month, applicable for both Faculty and Staff.\n*   No of Faculty Members allowed for CL on a given day from a department is limited to 30%.\n\nOne unavailed CL may be encashed every month. Encashed leaves may be accumulated and availed in the forthcoming months. If it is availed, the Previous encashed CL amount will be deducted accordingly (applicable only from December 2025).\n\nCL is allowed only on submission of Leave letter before availing CL. In case of emergency, permission is to be obtained by message /Phone call but this leave has to be confirmed from Principal in person on the next day.",
    "metadata": {
      "doc_id": "DOC4",
      "doc_title": "Leave Norms Circular",
      "doc_date": "2025-11-29",
      "doc_type": "Circular",
      "category": "Leave Policy",
      "chunk_index": 1
    }
  },

  {
    "id": "doc1_2",
    "document": "2) Medical Leave:\n*   ML should be intimated on the day of falling sick.\n*   ML will be allowed on submission of medical certificate and relevant documents for really deserving cases only, for all faculty and staff who have completed 3 years of Service at KEC.\n*   List to be sent to Secretary periodically through Principal / Correspondent.",
    "metadata": {
      "doc_id": "DOC4",
      "doc_title": "Leave Norms Circular",
      "doc_date": "2025-11-29",
      "doc_type": "Circular",
      "category": "Leave Policy",
      "chunk_index": 2
    }
  },

  {
    "id": "doc1_3",
    "document": "3) Maternity Leave:\n*   3 months with full pay for the faculty and staff who have completed 5 years of service.\n*   3 months with half pay for the faculty and staff who have service between 3 and 5 yrs.\n*   Maternity Leave not applicable for those with service less than 3 years.\n\nBeyond 3 months, Maternity Leave may be allowed on Loss of Pay up to the beginning of next academic year, beyond which the candidate may be relieved.",
    "metadata": {
      "doc_id": "DOC4",
      "doc_title": "Leave Norms Circular",
      "doc_date": "2025-11-29",
      "doc_type": "Circular",
      "category": "Leave Policy",
      "chunk_index": 3
    }
  },

  {
    "id": "doc1_4",
    "document": "4) Vacation:\n*   2 weeks winter vacation and 3 weeks summer vacation for faculty (who have complete of one year service).\n*   1 week winter vacation and 1 week summer vacation or two weeks cumulative summer vacation for non-teaching staff (who have completed 1 year of service).\n*   For Administrative Staff vacation will be sanctioned by the Principal.\n*   No vacation for those with service less than 1 year.\n*   Subject to minimum 2 faculty and 2 staff being present within the department",
    "metadata": {
      "doc_id": "DOC4",
      "doc_title": "Leave Norms Circular",
      "doc_date": "2025-11-29",
      "doc_type": "Circular",
      "category": "Leave Policy",
      "chunk_index": 4
    }
  },

  {
    "id": "doc1_5",
    "document": "5) Special Casual Leave:\n*   7 days per semester for all faculty members. If SCL exceeds 7 days per semester, then it will be treated as CL.\n\n6) On duty Leave:\n*   For official purpose only for all faculty, staff and research scholars.",
    "metadata": {
      "doc_id": "DOC4",
      "doc_title": "Leave Norms Circular",
      "doc_date": "2025-11-29",
      "doc_type": "Circular",
      "category": "Leave Policy",
      "chunk_index": 5
    }
  },

  {
    "id": "doc1_6",
    "document": "7) Compensation off:\n*   To be sanctioned by Principal for all faculty and Staff.\n*   Allowed only if duty attended during holidays and attendance registered through bio-metric.\n*   Compensation off not applicable for Shift Duties like in Library, Electrical Maintenance, Computer Centre, Kongu CRS etc. for regular Saturday – Sunday holidays.\n*   Compensation leave can be availed within 2 months.\n\n8) Permission / Biometric late punch / Biometric early punch\n*   Limited to 2 per month for all faculty and staff. If it exceeds 2, Half a day CL will be deducted per excess from the available leave.",
    "metadata": {
      "doc_id": "DOC4",
      "doc_title": "Leave Norms Circular",
      "doc_date": "2025-11-29",
      "doc_type": "Circular",
      "category": "Leave Policy",
      "chunk_index": 6
    }
  },

  {
    "id": "doc1_7",
    "document": "9) Bio metric Missing Punch:\n*   Regularization by Principal’s permission for all faculty and staff.\n\n10) Overtime allowance for non-teaching staff:\n*   Not allowed\n\nFor all the leaves, exceeding or not conforming to the limits given above, CL, if available, will be deducted; If CL is not available, it will be treated as LoP.",
    "metadata": {
      "doc_id": "DOC4",
      "doc_title": "Leave Norms Circular",
      "doc_date": "2025-11-29",
      "doc_type": "Circular",
      "category": "Leave Policy",
      "chunk_index": 7
    }
  },

  {
    "id": "doc1_8",
    "document": "PRINCIPAL\n\nTo\nAll Departments for circulation\nRegistrar\nFile\n\nCopy submitted to the Correspondent, KEC\nCopy submitted to the Secretary, KVITT",
    "metadata": {
      "doc_id": "DOC4",
      "doc_title": "Leave Norms Circular",
      "doc_date": "2025-11-29",
      "doc_type": "Circular",
      "category": "Leave Policy",
      "chunk_index": 8
    }
  }
]
